create_library_set -name libset_fast\
   -timing\
    [list /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/FreePDK45_lib_v1.0_typical.lib\
    /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/FreePDK45_hvt_lib_v1.0_typical.lib\
    /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/pllclk.lib\
    /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/ram_256x16A.lib\
    /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/rom_512x16A.lib]\
   -aocv\
    [list /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/slow.aocv]
create_library_set -name libset_slow\
   -timing\
    [list /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/FreePDK45_lib_v1.0_worst.lib\
    /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/FreePDK45_hvt_lib_v1.0_worst.lib\
    /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/pllclk.lib\
    /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/ram_256x16A.lib\
    /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/rom_512x16A.lib]\
   -aocv\
    [list /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/libs/mmmc/slow.aocv]
create_rc_corner -name corner_worst_RMIN\
   -preRoute_res 0.8\
   -postRoute_res {0.8 0.8 0.8}\
   -preRoute_cap 1\
   -postRoute_cap 1\
   -postRoute_xcap 1\
   -preRoute_clkres 0\
   -preRoute_clkcap 0
create_rc_corner -name corner_worst_CMAX\
   -preRoute_res 1\
   -postRoute_res {1 1 1}\
   -preRoute_cap 1.2\
   -postRoute_cap {1.2 1.2 1.2}\
   -postRoute_xcap {1.2 1.2 1.2}\
   -preRoute_clkres 0\
   -preRoute_clkcap 0
create_rc_corner -name corner_worst_CMIN\
   -preRoute_res 1\
   -postRoute_res {1 1 1}\
   -preRoute_cap 0.8\
   -postRoute_cap {0.8 0.8 0.8}\
   -postRoute_xcap {0.8 0.8 0.8}\
   -preRoute_clkres 0\
   -preRoute_clkcap 0
create_rc_corner -name corner_worst_RCMAX\
   -preRoute_res 1.2\
   -postRoute_res {1.2 1.2 1.2}\
   -preRoute_cap 1.2\
   -postRoute_cap {1.2 1.2 1.2}\
   -postRoute_xcap {1.2 1.2 1.2}\
   -preRoute_clkres 0\
   -preRoute_clkcap 0
create_rc_corner -name corner_worst_RMAX\
   -preRoute_res 1.2\
   -postRoute_res {1.2 1.2 1.2}\
   -preRoute_cap 1\
   -postRoute_cap 1\
   -postRoute_xcap 1\
   -preRoute_clkres 0\
   -preRoute_clkcap 0
create_rc_corner -name corner_worst_RCMIN\
   -preRoute_res 0.8\
   -postRoute_res {0.8 0.8 0.8}\
   -preRoute_cap 0.8\
   -postRoute_cap {0.8 0.8 0.8}\
   -postRoute_xcap {0.8 0.8 0.8}\
   -preRoute_clkres 0\
   -preRoute_clkcap 0
create_delay_corner -name delay_corner_slow_CMIN\
   -rc_corner corner_worst_CMIN\
   -early_library_set libset_slow\
   -late_library_set libset_slow
create_delay_corner -name delay_corner_fast_RCMAX\
   -rc_corner corner_worst_RCMAX\
   -early_library_set libset_fast\
   -late_library_set libset_fast
create_delay_corner -name delay_corner_fast_CMIN\
   -rc_corner corner_worst_CMIN\
   -early_library_set libset_fast\
   -late_library_set libset_fast
create_delay_corner -name delay_corner_fast_RCMIN\
   -rc_corner corner_worst_RCMIN\
   -early_library_set libset_fast\
   -late_library_set libset_fast
create_delay_corner -name delay_corner_slow_RMAX\
   -rc_corner corner_worst_RMAX\
   -early_library_set libset_slow\
   -late_library_set libset_slow
create_delay_corner -name delay_corner_fast_RMAX\
   -rc_corner corner_worst_RMAX\
   -early_library_set libset_fast\
   -late_library_set libset_fast
create_delay_corner -name delay_corner_slow_RCMAX\
   -rc_corner corner_worst_RCMAX\
   -early_library_set libset_slow\
   -late_library_set libset_slow
create_delay_corner -name delay_corner_slow_RMIN\
   -rc_corner corner_worst_RMIN\
   -early_library_set libset_slow\
   -late_library_set libset_slow
create_delay_corner -name delay_corner_slow_CMAX\
   -rc_corner corner_worst_CMAX\
   -early_library_set libset_slow\
   -late_library_set libset_slow
create_delay_corner -name delay_corner_fast_RMIN\
   -rc_corner corner_worst_RMIN\
   -early_library_set libset_fast\
   -late_library_set libset_fast
create_delay_corner -name delay_corner_slow_RCMIN\
   -rc_corner corner_worst_RCMIN\
   -early_library_set libset_slow\
   -late_library_set libset_slow
create_delay_corner -name delay_corner_fast_CMAX\
   -rc_corner corner_worst_CMAX\
   -early_library_set libset_fast\
   -late_library_set libset_fast
create_constraint_mode -name functionnal_mode\
   -sdc_files\
    [list for_Tempus_leakage.enc.dat/mmmc/modes/functionnal_mode/functionnal_mode.sdc]
create_constraint_mode -name test_mode\
   -sdc_files\
    [list /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/mmmc/dtmf_recvr_core.test.sdc]
create_constraint_mode -name scan_mode\
   -sdc_files\
    [list /userspace/hmarc/lnxsodt3_export/ECO_LAB_ETS132/work/titi.enc.dat/mmmc/dtmf_recvr_core.scan.sdc]
create_analysis_view -name test_slow_CMIN -constraint_mode test_mode -delay_corner delay_corner_slow_CMIN
create_analysis_view -name scan_fast_RMAX -constraint_mode scan_mode -delay_corner delay_corner_fast_RMAX
create_analysis_view -name func_slow_CMIN -constraint_mode functionnal_mode -delay_corner delay_corner_slow_CMIN
create_analysis_view -name test_fast_CMAX -constraint_mode test_mode -delay_corner delay_corner_fast_CMAX
create_analysis_view -name func_fast_CMAX -constraint_mode functionnal_mode -delay_corner delay_corner_fast_CMAX
create_analysis_view -name test_fast_RMIN -constraint_mode test_mode -delay_corner delay_corner_fast_RMIN
create_analysis_view -name scan_slow_RMAX -constraint_mode scan_mode -delay_corner delay_corner_slow_RMAX
create_analysis_view -name func_fast_RMIN -constraint_mode functionnal_mode -delay_corner delay_corner_fast_RMIN
create_analysis_view -name test_slow_RCMAX -constraint_mode test_mode -delay_corner delay_corner_slow_RCMAX
create_analysis_view -name scan_fast_RCMIN -constraint_mode scan_mode -delay_corner delay_corner_fast_RCMIN
create_analysis_view -name func_slow_RCMAX -constraint_mode functionnal_mode -delay_corner delay_corner_slow_RCMAX
create_analysis_view -name test_slow_CMAX -constraint_mode test_mode -delay_corner delay_corner_slow_CMAX
create_analysis_view -name func_slow_CMAX -constraint_mode functionnal_mode -delay_corner delay_corner_slow_CMAX
create_analysis_view -name test_slow_RMIN -constraint_mode test_mode -delay_corner delay_corner_slow_RMIN
create_analysis_view -name func_slow_RMIN -constraint_mode functionnal_mode -delay_corner delay_corner_slow_RMIN
create_analysis_view -name test_fast_RMAX -constraint_mode test_mode -delay_corner delay_corner_fast_RMAX
create_analysis_view -name scan_fast_CMIN -constraint_mode scan_mode -delay_corner delay_corner_fast_CMIN
create_analysis_view -name func_fast_RMAX -constraint_mode functionnal_mode -delay_corner delay_corner_fast_RMAX
create_analysis_view -name test_fast_RCMIN -constraint_mode test_mode -delay_corner delay_corner_fast_RCMIN
create_analysis_view -name scan_fast_RCMAX -constraint_mode scan_mode -delay_corner delay_corner_fast_RCMAX
create_analysis_view -name func_fast_RCMIN -constraint_mode functionnal_mode -delay_corner delay_corner_fast_RCMIN
create_analysis_view -name test_slow_RMAX -constraint_mode test_mode -delay_corner delay_corner_slow_RMAX
create_analysis_view -name scan_slow_CMIN -constraint_mode scan_mode -delay_corner delay_corner_slow_CMIN
create_analysis_view -name func_slow_RMAX -constraint_mode functionnal_mode -delay_corner delay_corner_slow_RMAX
create_analysis_view -name scan_slow_RCMIN -constraint_mode scan_mode -delay_corner delay_corner_slow_RCMIN
create_analysis_view -name scan_fast_CMAX -constraint_mode scan_mode -delay_corner delay_corner_fast_CMAX
create_analysis_view -name test_fast_RCMAX -constraint_mode test_mode -delay_corner delay_corner_fast_RCMAX
create_analysis_view -name scan_fast_RMIN -constraint_mode scan_mode -delay_corner delay_corner_fast_RMIN
create_analysis_view -name func_fast_RCMAX -constraint_mode functionnal_mode -delay_corner delay_corner_fast_RCMAX
create_analysis_view -name test_fast_CMIN -constraint_mode test_mode -delay_corner delay_corner_fast_CMIN
create_analysis_view -name scan_slow_CMAX -constraint_mode scan_mode -delay_corner delay_corner_slow_CMAX
create_analysis_view -name func_fast_CMIN -constraint_mode functionnal_mode -delay_corner delay_corner_fast_CMIN
create_analysis_view -name scan_slow_RMIN -constraint_mode scan_mode -delay_corner delay_corner_slow_RMIN
create_analysis_view -name test_slow_RCMIN -constraint_mode test_mode -delay_corner delay_corner_slow_RCMIN
create_analysis_view -name scan_slow_RCMAX -constraint_mode scan_mode -delay_corner delay_corner_slow_RCMAX
create_analysis_view -name func_slow_RCMIN -constraint_mode functionnal_mode -delay_corner delay_corner_slow_RCMIN
set_analysis_view -setup [list func_slow_CMAX func_fast_CMAX] -hold [list func_slow_CMAX func_fast_CMAX]
