# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line

create_library_set -name default_emulate_libset_max -timing {../../libs/liberty/pllclk_slow.lib.gz ../../libs/liberty/rom_via_metro_ss_1p08v_1p08v_125c_syn.lib.gz ../../libs/liberty/scmetro_cmos10lp_rvt_ss_1p08v_125c.lib.gz ../../libs/liberty/scmetropmk_cmos10lp_rvt_ss_0p9v_125c.lib.gz ../../libs/liberty/scmetropmk_cmos10lp_rvt_ss_0p9v_1p08v_125c.lib.gz ../../libs/liberty/scmetropmk_cmos10lp_rvt_ss_1p08v_0p9v_125c.lib.gz ../../libs/liberty/scmetropmk_cmos10lp_rvt_ss_1p08v_125c.lib.gz ../../libs/liberty/sram_sp_metro_ss_1p08v_1p08v_125c_syn.lib.gz}
create_library_set -name default_emulate_libset_min -timing {../../libs/liberty/pllclk_slow.lib.gz ../../libs/liberty/rom_via_metro_ss_1p08v_1p08v_125c_syn.lib.gz ../../libs/liberty/scmetro_cmos10lp_rvt_ss_1p08v_125c.lib.gz ../../libs/liberty/scmetropmk_cmos10lp_rvt_ss_0p9v_125c.lib.gz ../../libs/liberty/scmetropmk_cmos10lp_rvt_ss_0p9v_1p08v_125c.lib.gz ../../libs/liberty/scmetropmk_cmos10lp_rvt_ss_1p08v_0p9v_125c.lib.gz ../../libs/liberty/scmetropmk_cmos10lp_rvt_ss_1p08v_125c.lib.gz ../../libs/liberty/sram_sp_metro_ss_1p08v_1p08v_125c_syn.lib.gz}

create_timing_condition -name default_mapping_tc_2 -library_sets [list default_emulate_libset_max]
create_timing_condition -name default_mapping_tc_1 -library_sets [list default_emulate_libset_min]

create_rc_corner -name default_emulate_early_rc_corner
create_rc_corner -name default_emulate_late_rc_corner
create_rc_corner -name default_emulate_rc_corner

create_constraint_mode -name default_emulate_constraint_mode -sdc_files {../scripts/dtmf_recvr_core.sdc}

#create_delay_corner -name default_emulate_delay_corner_max -rc_corner {default_emulate_rc_corner}
#create_delay_corner -name default_emulate_delay_corner_min -rc_corner {default_emulate_rc_corner}
create_delay_corner -name default_emulate_delay_corner -early_timing_condition {default_mapping_tc_1} -late_timing_condition {default_mapping_tc_2} -rc_corner {default_emulate_rc_corner} 

create_analysis_view -name default_emulate_view -constraint_mode {default_emulate_constraint_mode} -delay_corner {default_emulate_delay_corner}
set_analysis_view -setup {default_emulate_view} -hold {default_emulate_view}
