###############################################################
#  Generated by:      Cadence Encounter 14.10-p003_1
#  OS:                Linux x86_64(Host ID logsfln2)
#  Generated on:      Mon Jun 23 19:58:10 2014
#  Design:            dtmf_recvr_core
#  Command:           saveDesign dtmf_recvr_core-postroute.enc
###############################################################
current_design dtmf_recvr_core
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {refclk}]  -name refclk -period 40.000000 -waveform {0.000000 20.000000}
create_clock [get_pins {TEST_CONTROL_INST/m_rcc_clk}]  -name m_rcc_clk -period 40.000000 -waveform {0.000000 20.000000}
create_clock [get_pins {TEST_CONTROL_INST/m_clk}]  -name m_clk -period 40.000000 -waveform {0.000000 20.000000}
create_clock [get_pins {TEST_CONTROL_INST/m_ram_clk}]  -name m_ram_clk -period 40.000000 -waveform {0.000000 20.000000}
create_clock [get_pins {TEST_CONTROL_INST/m_dsram_clk}]  -name m_dsram_clk -period 40.000000 -waveform {0.000000 20.000000}
create_clock [get_pins {TEST_CONTROL_INST/m_digit_clk}]  -name m_digit_clk -period 40.000000 -waveform {0.000000 20.000000}
create_clock [get_pins {TEST_CONTROL_INST/m_spi_clk}]  -name m_spi_clk -period 40.000000 -waveform {0.000000 20.000000}
set_propagated_clock  [get_pins {TEST_CONTROL_INST/m_ram_clk}]
set_propagated_clock  [get_pins {TEST_CONTROL_INST/m_digit_clk}]
set_propagated_clock  [get_pins {TEST_CONTROL_INST/m_spi_clk}]
set_propagated_clock  [get_pins {TEST_CONTROL_INST/m_clk}]
set_propagated_clock  [get_pins {TEST_CONTROL_INST/m_dsram_clk}]
set_propagated_clock  [get_pins {TEST_CONTROL_INST/m_rcc_clk}]
set_case_analysis 0 [get_ports {scan_en}]
set_case_analysis 0 [get_ports {test_mode}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[12]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[2]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[13]}]
set_input_delay -add_delay 4.2 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[5]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {pllrst}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[6]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[10]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[13]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[14]}]
set_input_delay -add_delay 4.2 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[5]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[6]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[13]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[3]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[14]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[6]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[7]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[11]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {reset}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[14]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {int}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[15]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[6]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[7]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[14]}]
set_input_delay -add_delay 4.5 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[4]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[15]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[7]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {scan_clk}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[8]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[12]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[15]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {pllrst}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[7]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[8]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[15]}]
set_input_delay -add_delay 4.2 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[5]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[8]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {spi_data}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {ibias}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[9]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[13]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {ibias}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {int}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[8]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[9]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {scan_en}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {ibias}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {scan_en}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {test_mode}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[0]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[6]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[9]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[14]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {scan_clk}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {scan_en}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {ibias}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[9]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[1]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[7]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {scan_en}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {spi_data}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {spi_fs}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[15]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {spi_fs}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {test_mode}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[8]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[0]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {spi_fs}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[2]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[10]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {spi_fs}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {ibias}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[9]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[1]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[3]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {scan_en}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[11]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {reset}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {reset}]
set_input_delay -add_delay 4.5 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[4]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {reset}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[2]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[12]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[10]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {pllrst}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {reset}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {spi_fs}]
set_input_delay -add_delay 4.2 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[5]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[3]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[13]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[11]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {int}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[6]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {int}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[14]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {int}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[12]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {scan_clk}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {pllrst}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {scan_clk}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {spi_data}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[7]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {int}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {reset}]
set_input_delay -add_delay 4.2 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[5]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {scan_clk}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[15]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {spi_data}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[13]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {spi_data}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {scan_clk}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[8]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {test_mode}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[0]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[6]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {spi_data}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[14]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {test_mode}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[0]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {test_mode}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[0]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {ibias}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_in[9]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[1]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[7]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {int}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[15]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {test_mode}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[0]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {scan_en}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[1]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[1]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[2]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[8]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {scan_clk}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[1]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[2]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[10]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[10]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[2]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {spi_data}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {ibias}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[3]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[10]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {spi_fs}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_in[9]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[2]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[3]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {scan_en}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[11]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {test_mode}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[10]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[0]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[11]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[3]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[11]}]
set_input_delay -add_delay 4.5 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[4]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[3]}]
set_input_delay -add_delay 4.5 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[4]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[12]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {pllrst}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[12]}]
set_input_delay -add_delay 4.5 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[4]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[11]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_in[1]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_digit_clk}] [get_ports {pllrst}]
set_input_delay -add_delay 4 -clock [get_clocks {m_clk}] [get_ports {spi_fs}]
set_input_delay -add_delay 4 -clock [get_clocks {m_spi_clk}] [get_ports {reset}]
set_input_delay -add_delay 4.2 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[5]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_in[12]}]
set_input_delay -add_delay 4 -clock [get_clocks {m_rcc_clk}] [get_ports {pllrst}]
set_input_delay -add_delay 4.2 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_in[5]}]
set_input_delay -add_delay 4 -clock [get_clocks {refclk}] [get_ports {port_pad_data_in[13]}]
set_input_delay -add_delay 4.5 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_in[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[8]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {tdigit[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {tdigit[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {tdigit_flag}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {tdigit[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {tdigit[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {tdigit[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[11]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {tdigit[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {tdigit[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[9]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {tdigit[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[12]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[10]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {vcom}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {tdigit[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[13]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[11]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {vcop}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {tdigit[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {tdigit[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[14]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[12]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {vcom}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {tdigit[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {tdigit[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[15]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[13]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {vcop}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {tdigit[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {tdigit[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[14]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[8]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {tdigit[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {tdigit_flag}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {tdigit[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[8]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[8]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[15]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[9]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {tdigit[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {tdigit[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[8]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[9]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[10]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[9]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[10]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {tdigit[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {tdigit[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {tdigit_flag}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[9]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[10]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[11]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[10]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[11]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {tdigit[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {tdigit[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[11]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[12]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[8]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {vcom}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[11]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[12]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {tdigit[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {tdigit[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {vcom}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[12]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {vcom}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[13]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[9]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {vcop}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[13]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {tdigit[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {tdigit[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[12]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {vcom}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {vcop}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {tdigit[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[10]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[13]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {vcop}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {tdigit[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[14]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {tdigit[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {tdigit[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[13]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[14]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {vcop}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {tdigit[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {tdigit[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[11]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[14]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {tdigit[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[15]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {tdigit[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[14]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[15]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {tdigit[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {tdigit[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[12]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[15]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {vcom}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {tdigit[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[15]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {tdigit[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {tdigit_flag}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {tdigit[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {tdigit[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {tdigit_flag}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[13]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {vcop}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {tdigit[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {tdigit_flag}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {tdigit[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {tdigit[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {tdigit_flag}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {tdigit[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[14]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {tdigit[3]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {tdigit[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {tdigit[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[8]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {tdigit[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {port_pad_data_out[15]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {tdigit[4]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {tdigit[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {port_pad_data_out[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_clk}] [get_ports {port_pad_data_out[7]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_dsram_clk}] [get_ports {tdigit[2]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {tdigit[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[9]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {port_pad_data_out[0]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {port_pad_data_out[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {refclk}] [get_ports {tdigit[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_rcc_clk}] [get_ports {port_pad_data_out[1]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_ram_clk}] [get_ports {tdigit[5]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_digit_clk}] [get_ports {tdigit[6]}]
set_output_delay -add_delay 1 -clock [get_clocks {m_spi_clk}] [get_ports {port_pad_data_out[10]}]
set_false_path -hold  -from [get_clocks { m_spi_clk }] -to [get_clocks { m_clk }]
set_false_path  -from [get_ports {refclk test_mode reset}] 
set_dont_use  [get_lib_cells {FreePDK45_lib_v1.0/FILLCELL_X16}]
set_dont_use  [get_lib_cells {FreePDK45_lib_v1.0/FILLCELL_X32}]
set_dont_use  [get_lib_cells {FreePDK45_lib_v1.0/ANTENNA_X1}]
set_dont_use  [get_lib_cells {pllclk/pllclk}]
set_dont_use  [get_lib_cells {FreePDK45_lib_v1.0/LOGIC0_X1}]
set_dont_use  [get_lib_cells {USERLIB/ram_256x16A}]
set_dont_use  [get_lib_cells {FreePDK45_lib_v1.0/LOGIC1_X1}]
set_dont_use  [get_lib_cells {FreePDK45_lib_v1.0/FILLCELL_X1}]
set_dont_use  [get_lib_cells {FreePDK45_lib_v1.0/FILLCELL_X2}]
set_dont_use  [get_lib_cells {FreePDK45_lib_v1.0/FILLCELL_X4}]
set_dont_use  [get_lib_cells {FreePDK45_lib_v1.0/FILLCELL_X8}]
